tempcontent/dbssChm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>dbss程序讲解</title>
<!-- 2014-12-30 二 03:55 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="gaolan" />
</head>
<body>
<div id="content">
<h1 class="title">dbss程序讲解</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. g<sub>pMDSMain</sub></a>
<ul>
<li><a href="#sec-1-1">1.1. MD5Verify()</a></li>
</ul>
</li>
<li><a href="#sec-2">2. g<sub>pMDSMain</sub>-&gt;ChenkStartParam(argc,argv)</a>
<ul>
<li><a href="#sec-2-1">2.1. int CDBSSAPP::InitApp (int argc, char **argv)</a></li>
</ul>
</li>
<li><a href="#sec-3">3. g<sub>pMDSMain</sub>-&gt;RunApp()</a>
<ul>
<li><a href="#sec-3-1">3.1. server<sub>port</sub><sub>in</sub><sub>use</sub> 函数</a></li>
<li><a href="#sec-3-2">3.2. server<sub>start函数</sub></a>
<ul>
<li><a href="#sec-3-2-1">3.2.1. theConfiguration.load(filename, tagName);</a></li>
<li><a href="#sec-3-2-2">3.2.2. theQmanager = new XQManager();</a></li>
<li><a href="#sec-3-2-3">3.2.3. theServer.start();</a></li>
</ul>
</li>
<li><a href="#sec-3-3">3.3. server<sub>open函数</sub></a>
<ul>
<li><a href="#sec-3-3-1">3.3.1. hashfds（char* str）</a></li>
<li><a href="#sec-3-3-2">3.3.2. CreateQueue</a></li>
</ul>
</li>
<li><a href="#sec-3-4">3.4. g<sub>CFrameToDb</sub>.begin ()</a></li>
<li><a href="#sec-3-5">3.5. while 主循环</a>
<ul>
<li><a href="#sec-3-5-1">3.5.1. server<sub>retrieve</sub>(strrBuff, nLen, hServerQueue)</a></li>
<li><a href="#sec-3-5-2">3.5.2. tStore.Store((unsigned char*)strrBuff)</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> g<sub>pMDSMain</sub></h2>
<div class="outline-text-2" id="text-1">
<p>
g<sub>pMDSMain是一个指向CDBSSAPP对象的指针。</sub>
在它的构造函数 CDBSSAPP::CDBSSAPP ()初始化 中，我们主要进行了license的认证工作，
如果证书过期的话，需要更换证书。
</p>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> MD5Verify()</h3>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> g<sub>pMDSMain</sub>-&gt;ChenkStartParam(argc,argv)</h2>
<div class="outline-text-2" id="text-2">
<p>
这里主要是对配置文件进行检查，读取参数，以及完成dbss程序必要的初始化工作。
</p>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> int CDBSSAPP::InitApp (int argc, char **argv)</h3>
<div class="outline-text-3" id="text-2-1">
<p>
1.检测共享内存文件是否存在如果不存在则需要创造一个。：access("/dev/shm/dswshm", 0)
</p>
<ol class="org-ol">
<li>设置日志级别，初始化日志管理系统   ：g<sub>SetLogLevel</sub>(g<sub>nLogLevel</sub>);  InitLog("dbss", 10, 50, 64);
</li>
<li>共享内存的初始化工作             ：g<sub>CFrameToDb</sub>.RetrieveSSNSeq<sub>FromShmem</sub>();
</li>
<li>读取dbinfo.cfg                :int CDBSSAPP::ReadSysCfg (char *strIniFile)
主要有版本号，端口号，oracle 用户名,密码,服务实例名，table<sub>store</sub>,CFrameToDb初始化等等，内容比较多不再赘述。
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> g<sub>pMDSMain</sub>-&gt;RunApp()</h2>
<div class="outline-text-2" id="text-3">
<p>
RunApp是整个dbss程序的主要运行。它主要分为以下几大块儿。
</p>
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> server<sub>port</sub><sub>in</sub><sub>use</sub> 函数</h3>
<div class="outline-text-3" id="text-3-1">
<p>
通过netstat 命令检测端口号是否被占用，如果被占用程序退出。
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> server<sub>start函数</sub></h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> theConfiguration.load(filename, tagName);</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
这里将加载程序文件名，到配置文件对象中去。
</p>
</div>
</div>

<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> theQmanager = new XQManager();</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
这里我们将生成Qmanager对象,用来管理 memory cache.
</p>
</div>
</div>

<div id="outline-container-sec-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> theServer.start();</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
XServerThread类对象将会开启一个线程用来处理网络的通讯。
</p>
</div>
<ol class="org-ol"><li>svr = new ServerXSocket(port)<br  /><div class="outline-text-5" id="text-3-2-3-1">
<p>
       //7696
这里将生成ServerXSocket类对象,完成套接口初始化，监听地址的绑定，以及listen状态。
</p>
</div>
</li>

<li>selectReaders(avail)<br  /><div class="outline-text-5" id="text-3-2-3-2">
<p>
//意义不大，因为只有一个监听套接字
select()函数将会判断套接口是否可读，如果可读的话将会返回相应的套接口。
</p>
</div>
</li>

<li>acceptConnectionptr<br  /><div class="outline-text-5" id="text-3-2-3-3">
<p>
该函数将会返回一个新的套接口对象（XSOCKET）。
   即accept的返回值
</p>
</div>
</li>

<li>XServiceThread<br  /><div class="outline-text-5" id="text-3-2-3-4">
<p>
该过程上面新生成的套接口作为参数，产生一个新的子线程，
用来处理和 templatecdr之间的数据连接。
</p>
</div>
<ol class="org-ol"><li>XServiceThread::run()<br  /><div class="outline-text-6" id="text-3-2-3-4-1">
<p>
这里，我们将和templatecdr进行通讯处理，首先先判断传过来的数据前四个字符是否为xczy，如果不是则丢掉重新接收，
否则，我们将根据第5个字符(command) 来判定dbss做不同的处理动作。
</p>
</div>
</li>

<li>commandFactory-&gt;build(command, this)<br  /><div class="outline-text-6" id="text-3-2-3-4-2">
<p>
    该函数将根据不同的command 值来返回相应的 XMWCommand 派生类对象。
心跳命令：XMWHeartBeatCmd
        读取数据命令：XMWDefaultCmd
</p>
</div>
</li>

<li>readRequest<br  /><div class="outline-text-6" id="text-3-2-3-4-3">
<ul class="org-ul">
<li>printg(data, qmessage.getMessage())  
这里我们将读到的数据，写入到 qmessage中。
</li>
<li>queueId = readlong(data+sizeof(XMessage));
这里将返回一个queueId. important
</li>
<li>XMemoryCache* pqueue = (theQmanager==NULL) ? NULL : theQmanager-&gt;OpenQueue(queueId)（后面会讲到）
 我们用上面的queueId，打开一个 XMemoryCache 类对象。该对象将通过使用fPutMsg这个函数把我们上面读到的数据
写入到缓存中。
</li>
</ul>
</div>
</li>
<li>writeResponse  暂无<br  /></li></ol>
</li></ol>
</div>
</div>








<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> server<sub>open函数</sub></h3>
<div class="outline-text-3" id="text-3-3">
<p>
主要通过theQmanager这个对象，来创造XMemoryCache值。
</p>
</div>
<div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> hashfds（char* str）</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
该函数 通过提供的字符串参数,生成出一个整形数值（handle),作为生成XMemoryCache 对象的参数。
</p>
</div>
</div>

<div id="outline-container-sec-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> CreateQueue</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
生成一个CreateQueue交由theQmanager来管理.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> g<sub>CFrameToDb</sub>.begin ()</h3>
<div class="outline-text-3" id="text-3-4">
<p>
通过帐号密码，链接oracle 数据库。
</p>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> while 主循环</h3>
<div class="outline-text-3" id="text-3-5">
</div><div id="outline-container-sec-3-5-1" class="outline-4">
<h4 id="sec-3-5-1"><span class="section-number-4">3.5.1</span> server<sub>retrieve</sub>(strrBuff, nLen, hServerQueue)</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
在while 循环中 ，该函数将根据hServerQueue找到对应的XMemoryCache对象，
然后将数据取出，存入到strrBuff中去。
</p>
</div>
</div>

<div id="outline-container-sec-3-5-2" class="outline-4">
<h4 id="sec-3-5-2"><span class="section-number-4">3.5.2</span> tStore.Store((unsigned char*)strrBuff)</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: gaolan</p>
<p class="date">Created: 2014-12-30 二 03:55</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.1)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
